Subject: Application for {job_title} role at {company}

Dear Hiring Manager,

I am writing to express my interest in the {job_title} role at {company}, as advertised on your website. With my extensive experience in managing and leading teams, implementing strategic plans, developing partnerships, and delivering high-quality training programs, I am confident that I can make a significant contribution to your organization.

As a Managing Director at IMSET GABES/Honoris United Universities Gabes, I successfully implemented strategic plans to expand the institute's reach and impact, resulting in a 25% increase in enrollment and a 30% increase in revenue. I also built and maintained a high-performance culture, attracted and retained top talent, and successfully developed and executed partnership strategies resulting in the signing of more than 20 partnership contracts with key external stakeholders.

As a Head of Internships and Ecosystem Department at IMSET GABES/Honoris United Universities Gabes, I developed and managed the institute's internship program, serving as the Employability Advisor, and collaborated closely with the Honoris Career Center to enhance students and alumni's employability through webinars, workshops, and events.

During my tenure as a Fully Remote PR & Communications Lead at The School of Travel Amman, I developed and executed the company's PR and communications strategy, created compelling content, managed media relations, built and maintained strong relationships with key influencers and partners, and organized and executed successful virtual events.

As a Manager at Center for Democracy, Citizenship, and Development CD2 Sfax, I led the implementation of the project and strengthened the capacities of civil society organizations and municipalities through targeted training, coaching, and technical assistance.

As a Project Manager at DANSEURS CITOYENS SUD, I managed and oversaw various projects, totaling $132,000 in funding, and benefited over 400 individuals in the regions of Sfax, Gabes, Medenine, and Tataouine.

Finally, as an Administrative and Financial Assistant at CEED TUNISIA, I designed and implemented comprehensive training programs for startup entrepreneurs, coordinated and conducted research, facilitated regular partner and grantee meetings, and arranged travel and accommodation for program staff and visiting stakeholders.

I hold a Master's degree in Finance and Economic Development (Research) from ISAAS SFAX, a Bachelor's degree in Management from IHEC SFAX, and a Graduate Certificate in English Language from Bourguiba Institute of Modern Languages (IBLV).

Please find attached my resume and certificate for your review. Thank you for considering my application. I look forward to the opportunity to discuss my qualifications further.

Sincerely,

{fullname}

{phone_number}